## Se cargan los tres datasets en uno solo para dar respuesta a los endpoints

In [44]:
import pandas as pd

## Dataset steam_games

In [50]:
df_steam_games = pd.read_parquet('Dataset/steam_games.parquet')
df_steam_games['item_id'] = df_steam_games['item_id'].astype(int)
df_steam_games.head(2), df_steam_games.info()

<class 'pandas.core.frame.DataFrame'>
Index: 68023 entries, 88310 to 120443
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   genres        68023 non-null  object
 1   title         68023 non-null  object
 2   release_date  68017 non-null  object
 3   price         68023 non-null  float64
 4   item_id       68023 non-null  int32
 5   developer     68023 non-null  object
dtypes: float64(1), int32(1), object(4)
memory usage: 3.4+ MB

(       genres                title release_date  price  item_id  developer
 88310  Action  Lost Summoner Kitty         2018   4.99   761140  Kotoshiro
 88310  Casual  Lost Summoner Kitty         2018   4.99   761140  Kotoshiro,
 None)

## Dataset user_review

In [51]:
df_review = pd.read_parquet('Dataset/user_review.parquet')
df_review['item_id'] = df_review['item_id'].astype(int)
df_review.sample(2), df_review.info()

<class 'pandas.core.frame.DataFrame'>
Index: 59305 entries, 0 to 25798
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   user_id             59305 non-null  object
 1   item_id             59305 non-null  int32
 2   recommend           59305 non-null  bool
 3   sentiment_analysis  59305 non-null  int64
dtypes: bool(1), int32(1), int64(1), object(1)
memory usage: 1.6+ MB

(                 user_id  item_id  recommend  sentiment_analysis
 13105  76561198147318547   242760       True                   2
 21749            LPTHTF2   245550       True                   2,
 None)

## Dataset user_items

In [52]:
df_items = pd.read_parquet('Dataset/user_items.parquet')
df_items.head(3)

             user_id  items_count  playtime_forever  playtime_2weeks
0  76561197970982479          277               6.0              0.0
1  76561197970982479          277               0.0              0.0
2  76561197970982479          277               7.0              0.0

In [41]:
df_items.shape

(2916386, 4)

## Dataset Final

Se hace el merge de los 3 DataFrames a traves de la columna 'item_id'

In [53]:
df_1 = pd.merge(df_steam_games, df_review, on = 'item_id' )

In [54]:
df = pd.merge(df_1, df_items, on = 'user_id' )

In [55]:
df.shape

(8344484, 12)

Se verifican duplicados y se borran

In [56]:
df.duplicated(subset=df.columns).sum()

148206

In [57]:
df.drop_duplicates(keep= 'last', inplace=True)

In [58]:
df.shape

(8196278, 12)

In [59]:
df.to_parquet("Dataset/data_final.parquet")
df.head()

,genres,title,release_date,price,item_id,developer,user_id,recommend,sentiment_analysis,items_count,playtime_forever,playtime_2weeks
0,Action,Carmageddon Max Pack,1997,9.99,282010,Stainless Games Ltd,InstigatorAU,True,1,112,259.0,0.0
1,Action,Carmageddon Max Pack,1997,9.99,282010,Stainless Games Ltd,InstigatorAU,True,1,112,0.0,0.0
2,Action,Carmageddon Max Pack,1997,9.99,282010,Stainless Games Ltd,InstigatorAU,True,1,112,7410.0,0.0
3,Action,Carmageddon Max Pack,1997,9.99,282010,Stainless Games Ltd,InstigatorAU,True,1,112,66.0,0.0
4,Action,Carmageddon Max Pack,1997,9.99,282010,Stainless Games Ltd,InstigatorAU,True,1,112,9.0,0.0

In [60]:
df.head(1)

,genres,title,release_date,price,item_id,developer,user_id,recommend,sentiment_analysis,items_count,playtime_forever,playtime_2weeks
0,Action,Carmageddon Max Pack,1997,9.99,282010,Stainless Games Ltd,InstigatorAU,True,1,112,259.0,0.0

Dataset para el endpoint 2

In [61]:
df_endpoint_2 = df[['price','user_id','recommend','items_count']] 
df_endpoint_2.to_parquet("Dataset/endpoint_2.parquet")
df_endpoint_2

         price       user_id  recommend  items_count
0         9.99  InstigatorAU       True          112
1         9.99  InstigatorAU       True          112
2         9.99  InstigatorAU       True          112
3         9.99  InstigatorAU       True          112
4         9.99  InstigatorAU       True          112
...        ...           ...        ...          ...
8344479   9.99        lachwe       True           24
8344480   9.99        lachwe       True           24
8344481   9.99        lachwe       True           24
8344482   9.99        lachwe       True           24
8344483   9.99        lachwe       True           24

[8196278 rows x 4 columns]

Dataset enpoint 3

In [67]:
df_endpoint_3 = df[['user_id', 'playtime_forever', 'genres', 'release_date']]
df_endpoint_3.to_parquet("Dataset/endpoint_3.parquet")
df_endpoint_3

              user_id  playtime_forever  genres release_date
0        InstigatorAU             259.0  Action         1997
1        InstigatorAU               0.0  Action         1997
2        InstigatorAU            7410.0  Action         1997
3        InstigatorAU              66.0  Action         1997
4        InstigatorAU               9.0  Action         1997
...               ...               ...     ...          ...
8344479        lachwe            3248.0  Action         2004
8344480        lachwe            1697.0  Action         2004
8344481        lachwe           26437.0  Action         2004
8344482        lachwe               6.0  Action         2004
8344483        lachwe            1226.0  Action         2004

[8196278 rows x 4 columns]

Dataset endpoint 4 y 5

In [69]:
df_endpoint_4_5 = df[['developer', 'recommend', 'release_date', 'sentiment_analysis']]
df_endpoint_4_5.to_parquet('Dataset/endpoint_4_5.parquet')
df_endpoint_4_5

                   developer  recommend release_date  sentiment_analysis
0        Stainless Games Ltd       True         1997                   1
1        Stainless Games Ltd       True         1997                   1
2        Stainless Games Ltd       True         1997                   1
3        Stainless Games Ltd       True         1997                   1
4        Stainless Games Ltd       True         1997                   1
...                      ...        ...          ...                 ...
8344479                Valve       True         2004                   0
8344480                Valve       True         2004                   0
8344481                Valve       True         2004                   0
8344482                Valve       True         2004                   0
8344483                Valve       True         2004                   0

[8196278 rows x 4 columns]